/*!
 * \file
 * \brief 程序入口
 * \sa http://en.cppreference.com/w/c/language/main_function
 * \author zhengrr
 * \date 2016-10-9 – 10-10
 * \copyright The MIT License
 ******************************************************************************/
#include <stdlib.h>

/*!
 * \brief 程序入口
 * \param argc 参数计数
 * \param argv 参数向量
 * \return 退出状态
 **********************************************************/
int main(int argc, char *argv[]) {
   return EXIT_SUCCESS;
}

/*
 * C89
 ******************************************************************************/
#ifdef __STDC__
#endif// C89

/*
 * C95
 ******************************************************************************/
#if 199409L <= __STDC_VERSION__
#endif// C95

/*
 * C99
 ******************************************************************************/
#if 199901L <= __STDC_VERSION__
#endif// C99

/*
 * C11
 ******************************************************************************/
#if 201112L <= __STDC_VERSION__
#endif// C11
